Repository: ARamy23/The-One
Catalog: Al Najd/Resources/*.lproj/Localizables.strings
Languages: ar

source: generic_error
ar: حدث خطأ ما...

source: email_not_valid
ar: هذا الإيمال غير صالح.

source: password_too_short
ar: كلمة المرور قصيرة للغاية

source: names_cant_contain_numbers
ar: الأسماء لا يوجد فيها أرقام

source: names_cant_contain_special_characters
ar: الأسماء لا يوجد فيها حروف غريبة.

source: names_cant_contain_emojis
ar: الأسماء لا يوجد فيها ايموجيز.

source: field_cant_be_empty
ar: ال%@ لا يمكن ان يكون فارغا.

source: password_hint_unlocked
ar: كلمة المرور.

source: your_current_password
ar: كلمة المرور الحالية

source: category_name
ar: اسم الفئة: %@

source: category_description
ar: وصف الفئة: %@

source: category_calories
ar: عدد السعرات الحرارية: %@

source: Welcome To The Najd
ar: اهلا بك في النچد

source: Your companion to a better Akhra
ar: رفيقك الي چنة الأخري

source: We Can
ar: بإمكاننا

source: Help you
ar: مساعدتك

source: To be a better version of
ar: حتي تصل إلي

source: Yourself
ar: همة أعلي!

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Make Salat Easy and Fun
ar: أجعل الصلاة سهلة و طيبة

source: By learning about the benefits of
ar: بتعلمك اكثر عن

source: Salat
ar: الصلاة و فوائدها

source: The Faard that was too hard
ar: ذاك الفرض اللذي كان صعبا

source: Is now calling you to pray it and Sunnah and Nafila!
ar: الآن اصبح يصلي معه السنة و النافلة!

source: See how far have you gone
ar: شاهد تطورك!

source: Be your own
ar: كن

source: Supervisor
ar: رقيب نفسك

source: And take yourself with Allah's (SWT) guidance
ar: و اسري بهدي الله و نفسك

source: To the highest ranks in Jannah
ar: إلي أعلي الچنة!

source: Join a supportive community of fellow Muslims!
ar: انضم إلي مجتمع من المسلمين المتكافلين

source: Choose
ar: اختر

source: the pal
ar: الصديق

source: before the
ar: قبل

source: Road
ar: الطريق

source: Get Started
ar: بينا نبدأ!

source: fajr
ar: الفچر

source: If the Sunnah was better than all of that is good on life, what do you think the Fajr is?
ar: إن كانت سنة الفچر خيرا من الدنيا و ما فيها, فما بالك بفرضها؟

source: duhr
ar: الظهر

source: There are 25+ benefit in Duhr, the best? Getting closer to Allah!
ar: هنالك اكثر من ٢٥ فضل في صلاة الظهر, افضلها انها تقربك من الله

source: aasr
ar: العصر

source: Now Repentence is easier, and so are Solutions to problems!
ar: الآن اصبحت التوبة اسهل, كذلك حلول المشاكل

source: maghrib
ar: المغرب

source: Wealth Buffed, Dua and Wishes Buffed, Blessing Showered, That's what you've won with Al Maghrib
ar: هنئا لك, اصبح مالك, و دعاءك, و امنياتك مباركة, و ان شاء الله يفيض الله عليك ببركات, هذا ما كسبت من صلاة المغرب

source: aishaa
ar: عشاء

source: Sleep and tranquility
ar: ليس فقط النوم المريح ما اكتسبت بالعشاء, بالنصف قيام الليل الأول, وما ادراك ما نصف قيام الليل

source: 2 Raqaat Before Fajr
ar: ركعتان قبل الفچر

source: Richest Man of all who didn't pray!
ar: اغني اهل الأرض لصلاتك لسنة الفچر

source: 4 Raqaat Before Duhr
ar: ٤ ركعات قبل الظهر

source: Your Iman Grow further!
ar: اصبحت الأن اقرب من الله

source: 2 Raqaat After Duhr
ar: ركعتان بعد الظهر

source: 2 Raqaat After Al Maghrib
ar: ركعات بعد المغرب

source: The Prophet SAW never left the Sunnah of Al Maghrib
ar: كان صلي الله عليه و سلم لا يترك ركعتان ما بعد المغرب لفضلهم

source: Well Done
ar: ما شاء الله! الله عليك! اتممت صلاوات %@ كلها, ما شاء الله!

source: Faraaid
ar: الفرائض

source: Sunnah
ar: السنن

source: Nafila
ar: النوافل

source: A day full of blessings is awaiting your deeds!
ar: يوما مليئ بالاعمال الطيبة في انتظارك!

source: Latest Reward
ar: اخر بركة

source: And var other blessings and Buffs...
ar: و %@ بركات و معززات اخري

source: Prayers
ar: الصلوات

source: Azkar
ar: الأذكار

source: Well Done You Managed to do All the Zekr!
ar: ما شاء الله! الله عليك! اتممت الأذكار كلها, ما شاء الله!

source: Azkar Al-Sabah
ar: اذكار الصباح

source: Azkar Al-Masaa
ar: اذكار المساء

source: RadytoBellah
ar: رضيت بالله ربا و بالإسلام دينا و بمحمد صلي الله عليه نبيا و رسولا

source: Allah Must Satisfy you
ar: كان حقا علي الله ان يرضيك .

source: Operation: White Heart
ar: العملية: قلب أبيض

source: Operation White Heart is the first Operation of Al Najd, where you, dear believer, will engage on a journey of Estigphar The operation might be difficult, but it ease up lots of future Plans!
ar: عملية القلب الأبيض هي أول عملية في النجد، حيث ستنخرط أنت، عزيزي المؤمن ، في رحلة استغفر. قد تكون العملية صعبة، لكنها تسهل الكثير من الخطط المستقبلية!

source: 30x Estigphar / 25 mins
ar: ٣٠ استغفار كل ٢٥ دقيقة

source: Plans
ar: الخطط

source: Embrace the Change
ar: اعتنق التغيير

source: Oh hey!, you made it to the plans page!
ar: اوه, اهلا وسهلا! لقد وجدت صحيفة الخطط

source: Good Job!
ar: احسنت!

source: We currently have only 1 plan for Estigphar, but more is Coming isA
ar: حاليا يوجد خطة واحدة فقط و هي الأستغفار, ولكن المزيد قادم إن شاء الله, فترقب!

source: rewards
ar: الجوائز

source: Today
ar: اليوم

source: Hint: Choosing a Date allows you to revisit your achievements at that date!
ar: لافتة: عندما تختار تاريخا, ستستطيع رؤية انجازاتك في هذا التاريخ!

source: Sounds
ar: اصوات

source: Sound Effects
ar: مؤثرات صوتية

source: Haptic Feedback
ar: ردود الفعل اللمسية

source: Sounds & Haptic Feedback
ar: اصوات & ردود الفعل اللمسية

source: Bless you
ar: بارك الله لك!

source: Repeats are left
ar: تكرار متبقي

source: That's the spirit!
ar: احسنت!

source: Al Najd
ar: النچد

source: Al Najd Aya
ar: ((وَهَدَيْنَاهُ النَّجْدَيْنِ))

source: Al Najd Translation
ar: اي الطريقين (طريق الخير, وطريق الشر).

source: Locked
ar: لم تحصل علي اي هداية من %@ بعد

source: hud-88
ar: إِنْ أُرِيدُ إِلَّا الْإِصْلَاحَ مَا اسْتَطَعْتُ ۚ وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ

source: Last n Days
ar: اخر %@ ايام

source: Keep it up, you can do it!
ar: يمكنك القيام بها!

source: Tip of the day
ar: نصيحة اليوم

source: Heads up!
ar: انتبه!

source: , and day
ar: , و %@

source: Well done on praying Al Fajr on day
ar: أبليت حسنا علي صلاتك للفجر في %@

source: Struggling? you got this, do you want to know who can help? Al Fajr!, make sure to pray it so other deeds become easier!
ar: صعب الأمر؟ لا تقلق, الشخص المناسب, انه الفچر!, لكي تسهل عليك العبادة, فقط استيقظ له, فيسهل الباقي!

source: Unfortunately there is not enough data to analyze this week
ar: للأسف, لا يوجد ما يكفي من البيانات لتحليل هذا الأسبوع

source: How about we make it a challenge to us to populate this with great deeds? wouldn't that be awesome?
ar: ما رأيك, ان نتخذه تحدي لأنفسنا ان نملئ هذا الأسبوع بأعمال جميلة؟ ألن يكون هذا رائعا؟

source: Wouldn't it be awesome if we had a week's worth of awesome deeds to display here? let's nail it this week!
ar: يا ليت كان هناك ما يكفي لملئ هذا الأسبوع بالأعمال الرائعة, سنفعلها هذا الأسبوع

source: Hmm, sad, but we still have a chance! let's pray hard this week!
ar: خسارة, لكن ماذال معانا وقت, بينا نجتهد هذا الأسبوع!

source: Dashboard
ar: بياناتي

source: Settings
ar: الإعدادات

source: 2 Raqaat After Al Aishaa
ar: ركعتان بعد العشاء

source: Other than being a Sunnah, it contribute towards being Qyam Layil
ar: غير انها سنة عن النبي, بل انها ايضا تساعدك في قيام الليل

source: Wetr
ar: رقعة وتر

source: Wetr when done with 7 Verses, is same as doing Qyam Al Layl
ar: إذا قرأت ٧ ايات بعد صلاة العشاء, فقد كتبت من من قام هذه الليلة

source: n out of n
ar: %@ من %@

source: Font Accessibility
ar: سهولة الكتابة

source: Increases or decreases the font size for better reading experience without straining your eye very much
ar: يتيح لك زيادة او إنقاص الكلام المكتوب لسهولة رؤيته

source: Allowed
ar: متاح

source: Denied
ar: ممنوع

source: Not Determined
ar: لم يتحدد بعد

source: Insufficient
ar: غير كافي

source: Accessibility
ar: إمكانية الوصول

source: Permissions
ar: الأذونات

source: Go to the iOS Settings Page
ar: إعدادات التطبيق

source: language character
ar: ض

source: Welcome to
ar: مرحبا بكم في

source: We hope we may be able to help you, even if by something so little
ar: نأمل أن نتمكن من مساعدتك، حتى لو كان ذلك عن طريق شيء صغير جدا

source: Don't like the colors? Font is too small? Got a permission you gave us before
ar: لا تحب الألوان؟ الخط صغير جدا؟ حصلت على إذن أعطيتنا إياه من قبل

source: but now you're not comfortable with it anymore?
ar: لكن الآن أنت لست مرتاحة معها بعد الآن؟

source: All of this and more (in the future In Shaa Allah) will be available from the Settings
ar: كل هذا وأكثر (في المستقبل إن شاء الله) سوف تكون متاحة من إعدادات

source: Got some day you'd like to revisit?
ar: هل لديك يوم تود إعادة النظر فيه؟

source: You can drag the Calendar from above
ar: يمكنك سحب النتيجة من الأعلى

source: And revisit your older self to see what insight did you get that day or your work
ar: وإعادة النظر في نفسك القديمة لمعرفة ما الترجيحات اللتي حصلت عليها ذلك اليوم

source: The Dashboard is also able to give insights
ar: هي أيضا قادرة على إعطاءك بعض النصائح

source: Like encourage you, praise you, give you some warning for missing critical deeds
ar: كتشجيعك، والثناء عليك، تعطيك بعض التحذير لتفويت الأعمال الحرجة

source: Or basically suggest an act combined with something else
ar: أو تشير عليك بخلط عملين او اكثر مع ذكر فضلهم

source: This is not done on any server, your data and actions are personal, and we intend to keep it that way
ar: لا يتم ذلك على أي خادم، البيانات والإجراءات الخاصة بك ستظل علي هاتفك ولا نية لنا في جمعها.

source: And our greatest feature ever (till now)
ar: ولدينا أعظم ميزة من أي وقت مضى (حتى الآن)

source: The Dashboard
ar: لوحة المعلومات

source: Where you will find how did you do during a time period (now its static to 7 days)
ar: حيث ستجد كيف فعلت خلال فترة زمنية (هي ثابتة عند 7 أيام حتي نحسنها)

source: And since it's in the nature of mankind to be materalistic
ar: وبما أنه في طبيعة البشرية أن تكون مادية

source: We took an effort to find what are the benefits of most of the deeds here
ar: لذلك بذلنا جهدا للعثور على فوائد معظم الأفعال هنا

source: By the way we need help with this, so if want to help, please reach me out through the settings page
ar: بالمناسبة نحن بحاجة إلى مساعدة في هذا، فإن كنت ترغب في مساعدتنا، يرجى ابلاغي

source: Azkar are the fort, your defense, and your offense
ar: الأذكار هي حصنك، دفاعك، وهجومك

source: Staying true to it will not only help you reach your destination
ar: الإلتزام بها لن يساعدك فقط في الوصول إلى وجهتك

source: But make your journey full of blessings, unexpected happiness and lots of peace
ar: ولكن جعل رحلتك كاملة من البركات والسعادة غير متوقعة والكثير من الراحة النفسية

source: Since Prayer is the column of Deen, we made it easy for you to keep
ar: بما أن الصلاة هي عمود دين، فقد سهلنا عليك الاحتفاظ بها

source: Track of it by just swiping from the side
ar: تتبع ذلك عن طريق سحبها من الجانب

source: Rise from your struggles, and pick
ar: قم من ظلمات انهزامك ، الي نور رحمة الله و اختار

source: Your Najd
ar: نچدك

source: It must become a
ar: يجب أن يصبح

source: Lighter
ar: مشرقا

source: The Road ahead is long, and unforgiving.
ar: إن الطريق أمامنا طويل ولا يرحم.

source: Not that for a dark heart
ar: ليس لقلب مظلم

source: Know your weapons, and that you will learn them, train on them, and hopefully from Allah, you will master them
ar: تعرف على أسلحتك، وأنك ستتعلمها، وتتدرب عليها، ونأمل من الله أن تتقنها

source: Remember that Islam is the only way to there now.
ar: تذكر أن الإسلام هو السبيل الوحيد إلى هناك الآن.

source: Remember why you're here in this
ar: تذكر لماذا أنت هنا في هذه

source: Dunia
ar: الدنيا

source: to start your Journey to your Home in
ar: لبدء رحلتك إلى منزلك في

source: Akhra
ar: أخرة

source: And that you're a
ar: وأنك

source: , whom
ar: , ممن

source: Remember
ar: تذكر

source: Allah
ar: الله

source: Wake up, Muslim.
ar: إستيقظ أيها المسلم.

source: Try to remember your self, your beautiful self, the alive one, not the current.
ar: حاول أن تتذكر نفسك، نفسك الجميلة، اللتي على قيد الحياة، لا المنهكة.

source: And that 'thing' you listen to, is not your friend, he is an enemy, but... Rest assured, for he's a weak one.
ar: وهذا "الشيء" الذي تستمع إليه، ليس صديقك، إنه عدو، لكن... إطمئن لأنه ضعيف

source: You're better than this, than not remembering why you're here.
ar: أنت أفضل من هذا، من عدم تذكر سبب وجودك هنا.

source: You don't remember why you're here, do you?
ar: أنت لا تتذكر لماذا أنت هنا، أليس كذلك؟

source: Wake up.
ar: إستيقظ.

source: This work is a Sadaqa for...
ar: هذا العمل هو صدقة جارية ل...

source: All Muslims
ar: جميع المسلمين

source: Those who passed away
ar: أولئك الذين توفاهم الله

source: And those who are living
ar: وأولئك الذين يعيشون

source: And those who may come after
ar: وأولئك الذين قد يأتون بعد رحيلنا

source: In the memory of my passed away
ar: في ذكرى وفاة

source: Grand Mother
ar: جدتي

source: I ask of you to
ar: أطلب منكم أن

source: Receit
ar: تقرأوا

source: Al Fatihaa
ar: الفاتحة

source: And to all our passed away closed ones. ❤️
ar: و لجميع اموات المسلمين. ❤️

source: May we reunite again with them in the highest paradise along all of those who preceeded us 🤲
ar: اللهم اجمعنا بهم جميعا في فردوسك الأعلي 🤲

source: to her
ar: لها

source: Muslim
ar: مسلم

source: Language
ar: اللغة

source: There is no where you can hide, Muslim
ar: لا يوجد مكان لك تهرب اليه, أيها المسلم

source: Put as much distance between you and the truth as you want
ar: ضع مسافة بقدر ما تشاء بينك و بين الحقيقة

source: It changes nothing
ar: لا يغير هذا شئ

source: Pretend to be everything that you're not.
ar: تذاهر بكل ما انت لست اهل له

source: A Good Person
ar: كشخص صالح

source: A Sheikh
ar: كشيخ

source: A Mo'men
ar: كمؤمن

source: But there is one unavoidable truth that you'll never escape
ar: ولكن, هناك امر واقع لا يمكنك تجاهلها

source: You can not change...
ar: لا يمكنك التغير

source: You will always be...
ar: ستظل دائما...

source: A Sinner
ar: عاصي

source: Well Done on praying Fajr and Aishaa 👏 If you prayed this in Group, the reward is like you've done Qeyam Al Layil of the whole night
ar: بارك الله فيك 👏 إن كنت صليتم في جماعة, فكأنما قمت الليل كله

source: al_ra3d_28
ar: الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ

source: prayer_title
ar: صلاة %@

source: sunnah_title
ar: سنة %@ %@

source: sunnah_affirmed
ar: (مؤكدة)

source: sunnah_desired
ar: (مستحبة)

source: raqaat_position_before
ar: قبل

source: raqaat_position_after
ar: بعد

source: estigphar
ar: استغفر الله

source: ant_al_salam
ar: اللهم انت السلام, ومنك السلام, تباركت يا ذا الجلال و الإكرام

source: la_ilah_ila_allah_wahdah
ar: لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، يُحيي ويُميت، وهو على كل شيءٍ قدير

source: la_ilah_ila_allah_wahdah_reward
ar: كُتِبَ له عشر حسناتٍ، ومُحِيَ عنه عشر سيئاتٍ، ورُفِعَ له عشر درجاتٍ، وكان يومه ذلك كلّه في حرزٍ من كل مكروهٍ، وحُرِسَ من الشَّيطان، ولم ينبغِ لذنبٍ أن يُدركه في ذلك اليوم، إلا الشِّرك بالله

source: mokhlseen_laho_l_deen
ar: لا إله إلا الله، مخلصين له الدين ولو كره الكافرون

source: la_mani3_lema_a3tyt
ar: اللهم لا مانع لما أعطيت ولا معطي لما منعت

source: subhan_allah
ar: سبحان الله

source: alhamdulellah
ar: الحمدلله

source: allahuakbar
ar: الله اكبر

source: la_ilah_ila_allah
ar: لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير

source: la_ilah_ila_allah_la_hawl_wala_qwata_ila_bellah
ar: لا إله إلا الله وحده لا شريكَ له، له الملك، وله الحمد، وهو على كل شيءٍ قدير لا حول ولا قوة إلا بالله, لا إله إلا الله, ولا نعبد إلا إياه, له النعمة, وله الفضل, وله الثناء الحسن

source: ayat_al_kursi
ar: آية الكرسي

source: ayat_al_ikhlas
ar: سورة الإخلاص

source: ayat_al_falaq
ar: سورة الفلق

source: ayat_al_alnas
ar: سورة الناس

source: today_summary
ar: محصلة اليوم

source: praying_streak
ar: سلسلة الصلاوات

source: doing_great
ar: انت شغال كويس, عاش جدا! كمل 🔥

source: dua_1
ar: حين يغشاك هم, وحين يثقل كاهلك دين, حين تتهم ظلم, وحين تفقد حبيبا, او تفارق عزيزا, حين تخطلت عليك الامور ويصعب عليك الاختيار, حين يهجم عليك الامتحان والاختبار, فأعلم, ان لك ربا, هو علي كل شئ قدير, وكل شئ عليه هين, فقط... توجه بقلبك, وادع ربك, إن يردك بخير, فلا راد لفضله, يصيب به من يشاء من عباده و هو الغفور الرحيم, ((إن كان لك حاجة, وليست لك قدرة, فإن لك ربا, له قدرة وليس له حاجة, ((يا أيها الناس, انتم الفقراء الي الله, والله هو الغني الحميد)) مهما كانت حاجتك, مهما بلغت شدتك, ومهما كانت قضيتك, هي علي الله شئ هين, ((اللذي خلقني فهو يهدين, واللذي هو يطعمن ويسقين, وإذا مرضت فهو يشفين)), انت اللذي صورتني, وخلقتني, وهديتني لشرائع الإيمان, انت اللذي اطعمتني, وسقيتني من غير كسب يد ولا دكان, انت اللذي آويتني, وحبوتني, وهديتني من حيرة الخزلان, وزرعت لي بين القلوب مودة, العفو منك برحمة وحنان, ونشرت لي في العالمين محاسنا, وسترت عن ابصارهم عصياني, فلك المحامد و المدائح كلها, بخواتري, وجوارحي, ولساني))

source: dua_2
ar: ادعي ان ربنا يفكرك دايما بالتوكل عليه في ادق ادق التفاصيل, و يبقي هو المعين الأول في الدعاء, ثم بعديه السعي و الأخذ بالأسباب

source: dua_3
ar: يا رب خلينا سبب في دخول حد الأسلام

source: dua_4
ar: اللهم اغفر للمؤمنين والمؤمنات والمسلمين والمسلمات الاحياء منهم والاموات

source: dua_5
ar: اللهم زدنا عباده و طاعه لك و إيماناً و وسع رزقنا بالحلال

source: dua_6
ar: اللهم متعنا بلقاء وجهك الكريم سبحانك و تعالى و لقاء عبدك و نبيك محمد صلى الله عليه وسلم و ندعيك ان تسقينا من حوض النبي صلى الله عليه وسلم شربةً لا يظمأ بعدها

source: dua_7
ar: ربنا لا تزغ قلوبنا بعد اذ هديتنا و هب لنا من لدنك رحمة, انك انت الوهاب

source: dua_8
ar: ربنا اتنا فى الدنيا حسنه و فى الاخره حسنه و قنا عذاب النار

source: dua_9
ar: اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي

source: dua_10
ar: اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ و اللهم اصلح نفوسنا

source: dua_11
ar: اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ و اللهم اصلح نفوسنا

source: dua_12
ar: اللهم ارزقنا حُسن الخُلق

source: dua_13
ar: اللهم ارزقنا حفظ القرآن الكريم

source: dua_14
ar: اللهم انا امنا فغفر لنا ذنوبنا و قنا عذاب النار

source: dua_15
ar: اللهم رضني بما قضيت... وعافني فيما عافيت... حتي لا احب تعجيل ما اخرت... ولا تأخير ما عجلت, فسبحانك انت من تعلم, وما لنا من العلم إلا ما رزقت, فارزقنا من الإيمان ما لا نسئلك ما ليس لنا به علم, سبحانك, انك انت العلي العليم

source: fajr_reward
ar: إن كانت سنة الفچر خيرا من الدنيا و ما فيها, فما بالك بفرضها؟

source: duhr_reward
ar: هنالك اكثر من ٢٥ فضل في صلاة الظهر, افضلها انها تقربك من الله

source: aasr_reward
ar: الآن اصبحت التوبة اسهل, كذلك حلول المشاكل

source: maghrib_reward
ar: هنئا لك, اصبح مالك, و دعاءك, و امنياتك مباركة, و ان شاء الله يفيض الله عليك ببركات, هذا ما كسبت من صلاة المغرب

source: ishaa_reward
ar: ليس فقط النوم المريح ما اكتسبت بالعشاء, بالنصف قيام الليل الأول, وما ادراك ما نصف قيام الليل

source: fajr_sunnah_reward
ar: اغني اهل الأرض لصلاتك لسنة الفچر

source: duhr_sunnah_reward
ar: اصبحت الأن اقرب من الله

source: maghrib_sunnah_reward
ar: كان صلي الله عليه و سلم لا يترك ركعتان ما بعد المغرب لفضلهم

source: ishaa_sunnah_reward
ar: غير انها سنة عن النبي, بل انها ايضا تساعدك في قيام الليل

source: wetr_reward
ar: إذا قرأت ٧ ايات بعد صلاة العشاء, فقد كتبت من من قام هذه الليلة

source: duha_reward
ar: صلاة الآوابين, نعم العباد, الله يمدح و يعتز بعباده الآوابين, فما اكرمها من عبادة ان يمدح الله اهلها و ياله من شرف عظيم, بل يجعل لك ايضا الله في كل عمل لك صدقة, و يجعل علي كل سلامة (عظمة في جسدك) صدقة!

source: qeyamAlLayl_reward
ar: شرف المؤمن, و اختص الله هذه الصلاة في الثلث الأخير من انه يتنزل الي السماء الدنيا فينادي علي عباده,هل من سائل فيعطى سؤله، هل من داع فيستجاب له، هل من مستغفر فيغفر له هل من تائب، فيتاب عليه؟, بل من معزة مصليها عند ربهم, يشع نور من بيته كل ليلة, حتي اذا غاب سئلت عنه الملائكة و دعت له اذا علمت بمرضه بالشفاء و استغفرت له

source: fard
ar: فرض

source: alfard
ar: الفرض

source: fard_not_done_yet
ar: لم تصل الفرض بعد.

source: nafila_not_done_yet
ar: لم تصل النافلة بعد.

source: tasks
ar: المهام

source: ahadeeth
ar: احاديث

source: hadeeth_1
ar: عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ: ((إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ)) رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة .

source: hadeeth_2
ar: نْ عُمَرَ رَضِيَ اللهُ تَعَالَى عَنْهُ أقَال : بَيْنَمَا نَحْنُ جُلُوْسٌ عِنْدَ رَسُولِ اللهِ ذَاتَ يَوْمٍ إَذْ طَلَعَ عَلَيْناَ رَجُلٌ شَدِيْدُ بَيَاضِ الثّياب شَدِيْدُ سَوَادِ الشَّعْرِ لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ وَلاَ يَعْرِفُهُ مِنا أحَدٌ حَتى جَلَسَ إلَى النبِي فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ وَوَضَعَ كَفيْهِ عَلَى فَخِذِيْهِ وَقَالَ : يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَم ، فَقَالَ رَسُولُ اللهِ ﷺ : ((الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إلَه إلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ الله ، وَتُقِيْمَ الصَّلاَة ، وَتُؤْتِيَ الزَّكَاةَ ، وَتَصُوْمَ رَمَضَانَ ، وَتَحُجَّ البيْتَ إِنِ اِسْتَطَعتَ إِليْهِ سَبِيْلاً)) قَالَ: صَدَقْتَ. فَعجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرِنيْ عَنِ الإِيْمَانِ، قَالَ: ((أَنْ تُؤمِنَ بِالله، وَمَلاِئكَتِه، وَكُتُبِهِ ، وَرُسُلِهِ ، وَالْيَومِ الآَخِر ، وَتُؤْمِنَ بِالقَدَرِ خَيْرِهِ وَشَرِّهِ)) قَالَ: صَدَقْتَ، قَالَ فَأخْبِرْنِيْ عَنِ الإِحْسَانِ، قَالَ: ((أَنْ تَعْبُدَ اللهَ كَأَنَكَ تَرَاهُ، فَإِنْ لمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ )) قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ ، قَالَ : ((مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ)) قَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَاتِها ، قَالَ : ((أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا ، وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُوْنَ فِي البُنْيَانِ)) ثْمَّ انْطَلَقَ فَلَبِثتُ مَلِيَّاً ثُمَّ قَالَ ((يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟)) قُلْتُ اللهُ وَرَسُوله أَعْلَمُ قَالَ: ((فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلَّمُكُمْ دِيْنَكُمْ)) .رواه مسلم

source: pick_date
ar: تاريخ اليوم

source: today_duaa
ar: دعاء اليوم

source: subh
ar: الصبح

source: shaf3
ar: الشفع

source: watr
ar: الوتر

source: duha
ar: الضحي

source: qeyam
ar: قيام الليل

source: nafila_subh_reward
ar: لم يتم الإطلاع بعد.

source: nafila_duha_reward
ar: صلاة الآوابين, نعم العباد, الله يمدح و يعتز بعباده الآوابين, فما اكرمها من عبادة ان يمدح الله اهلها و ياله من شرف عظيم, بل يجعل لك ايضا الله في كل عمل لك صدقة, و يجعل علي كل سلامة (عظمة في جسدك) صدقة!

source: nafila_shaf3_reward
ar: لم يتم الإطلاع بعد.

source: nafila_watr_reward
ar: لم يتم الإطلاع بعد.

source: nafila_qeyam_reward
ar: شرف المؤمن, و اختص الله هذه الصلاة في الثلث الأخير من انه يتنزل الي السماء الدنيا فينادي علي عباده,هل من سائل فيعطى سؤله، هل من داع فيستجاب له، هل من مستغفر فيغفر له هل من تائب، فيتاب عليه؟, بل من معزة مصليها عند ربهم, يشع نور من بيته كل ليلة, حتي اذا غاب سئلت عنه الملائكة و دعت له اذا علمت بمرضه بالشفاء و استغفرت له
